content/posts/The_Road_to_Reality_by_Roger_Penrose_in_2004.md
+++
title = "The Road to Reality by Roger Penrose in 2004"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:08-04:00
slug = "The_Road_to_Reality_by_Roger_Penrose_in_2004"
draft = false
+++

## 13. Symmetry groups {#13-dot-symmetry-groups}


## 14. Calculus on manifolds {#14-dot-calculus-on-manifolds}


## 15. Fibre bundles and gauge connections {#15-dot-fibre-bundles-and-gauge-connections}


### 15.1 Some physical motivations for fibre bundles {#15-dot-1-some-physical-motivations-for-fibre-bundles}


### 15.2 The mathematical idea of a bundle {#15-dot-2-the-mathematical-idea-of-a-bundle}


### 15.3 Cross-sections of bundles {#15-dot-3-cross-sections-of-bundles}


### 15.4 The Clifford bundle {#15-dot-4-the-clifford-bundle}


### 15.5 Complex vector bundles, (co)tangent bundles {#15-dot-5-complex-vector-bundles--co--tangent-bundles}


### 15.6 Projective spaces {#15-dot-6-projective-spaces}


### 15.7 Non-triviality in a bundle connection {#15-dot-7-non-triviality-in-a-bundle-connection}


### 15.8 Bundle curvature {#15-dot-8-bundle-curvature}


## 16. The ladder of infinity {#16-dot-the-ladder-of-infinity}


## 17. Spacetime {#17-dot-spacetime}


## 18. Minkowskian geometry {#18-dot-minkowskian-geometry}


## 19. The classical fields of Maxwell and Einstein {#19-dot-the-classical-fields-of-maxwell-and-einstein}


## 20. Lagrangians and Hamiltonians {#20-dot-lagrangians-and-hamiltonians}


## 21. The quantum principle {#21-dot-the-quantum-principle}


## 22. Quantum algebra, geometry, and spin {#22-dot-quantum-algebra-geometry-and-spin}


## 23. The entangled quantum world {#23-dot-the-entangled-quantum-world}


## 24. Dirac's electron and antiparticles {#24-dot-dirac-s-electron-and-antiparticles}


## 25. The standard model of particle physics {#25-dot-the-standard-model-of-particle-physics}


## 26. Quantum field theory {#26-dot-quantum-field-theory}


## 27. The big bang and its thermodynamic legacy {#27-dot-the-big-bang-and-its-thermodynamic-legacy}


## 28. Speculative theories of the early universe {#28-dot-speculative-theories-of-the-early-universe}


## 29. The measurement paradox {#29-dot-the-measurement-paradox}


## 30. Gravity's role in quantum state reduction {#30-dot-gravity-s-role-in-quantum-state-reduction}


## 31. Supersymmetry, supra-dimensionality, and strings {#31-dot-supersymmetry-supra-dimensionality-and-strings}


## 32. Einstein's narrower path; loop variables {#32-dot-einstein-s-narrower-path-loop-variables}


## 33. More radical perspectives; twistor theory {#33-dot-more-radical-perspectives-twistor-theory}


## 34. Where lies the road to reality {#34-dot-where-lies-the-road-to-reality}
